docs: update project README
